In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
u_cols = ['user_id', 'age', 'sex', 'occupation', 'zip_code']
users = pd.read_csv('./u.data', sep='\t', names=u_cols, encoding='latin-1')
users = users.set_index('user_id')
users.head()

         age  sex  occupation  zip_code
user_id
196      242    3   881250949       NaN
186      302    3   891717742       NaN
22       377    1   878887116       NaN
244       51    2   880606923       NaN
166      346    1   886397596       NaN

In [4]:
# u.itm 파일을 DataFrame으로 읽기
i_cols = ['movie_id', 'title', 'release date', 'video release date', 'IMDB URL', 
    'unknown', 'Action', 'Adventure', 'Animation', 'Children\'s', 'Comedy', 'Crime', 
    'Documentary', 'Drama', 'Fantasy', 'Film-Noir', 'Horror', 'Musical', 'Mystery', 
    'Romance', 'Sci-fi', 'Thriller', 'War', 'Western']
movies = pd.read_csv('./u.item', sep='|', names=i_cols, encoding='latin-1')
movies = movies.set_index('movie_id')
movies.head()

,title,release date,video release date,IMDB URL,unknown,Action,Adventure,Animation,Children's,Comedy,...,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-fi,Thriller,War,Western
movie_id,,,,,,,,,,,,,,,,,,,,,
1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...,0,0,0,1,1,1,...,0,0,0,0,0,0,0,0,0,0
2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...,0,1,1,0,0,0,...,0,0,0,0,0,0,0,1,0,0
3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...,0,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...,0,1,0,0,0,1,...,0,0,0,0,0,0,0,0,0,0
5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995),0,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0

In [5]:
# u.data
r_cols = ['user_id', 'movie_id', 'rating', 'timestamp']
ratings = pd.read_csv('./u.data', sep='\t', names=r_cols, encoding='latin-1')
ratings = ratings.set_index('user_id')
ratings.head()

         movie_id  rating  timestamp
user_id
196           242       3  881250949
186           302       3  891717742
22            377       1  878887116
244            51       2  880606923
166           346       1  886397596

In [31]:

ratings.groupby(['movie_id']).head()

# movie_mean = ratings.groupby(['movie_id'])['rating'].mean()
# recom_movie1(5)

         movie_id  rating  timestamp
user_id
196           242       3  881250949
186           302       3  891717742
22            377       1  878887116
244            51       2  880606923
166           346       1  886397596
...           ...     ...        ...
655          1641       3  887427810
416          1594       5  893212484
450          1490       3  882396929
399          1542       2  882348592
655           913       4  891817521

[7458 rows x 3 columns]

In [62]:
ratings.groupby(['movie_id'])['rating'].mean()

movie_id
1       3.878319
2       3.206107
3       3.033333
4       3.550239
5       3.302326
          ...
1678    1.000000
1679    3.000000
1680    2.000000
1681    3.000000
1682    3.000000
Name: rating, Length: 1682, dtype: float64

In [50]:
len(ratings)

100000

In [51]:
ratings.head()

         movie_id  rating  timestamp
user_id
196           242       3  881250949
186           302       3  891717742
22            377       1  878887116
244            51       2  880606923
166           346       1  886397596

In [56]:
ratings[ratings['movie_id'] == 1]

         movie_id  rating  timestamp
user_id
308             1       4  887736532
287             1       5  875334088
148             1       4  877019411
280             1       4  891700426
66              1       3  883601324
...           ...     ...        ...
895             1       4  879437950
747             1       5  888639138
786             1       4  882841828
800             1       4  887646283
593             1       3  875659150

[452 rows x 3 columns]

In [59]:
ratings.groupby(['movie_id']).get_group(1)

         movie_id  rating  timestamp
user_id
308             1       4  887736532
287             1       5  875334088
148             1       4  877019411
280             1       4  891700426
66              1       3  883601324
...           ...     ...        ...
895             1       4  879437950
747             1       5  888639138
786             1       4  882841828
800             1       4  887646283
593             1       3  875659150

[452 rows x 3 columns]

In [55]:
len(ratings.groupby(['movie_id'])['rating'])

1682

In [63]:
ratings.groupby(['movie_id'])['rating'].mean()

movie_id
1       3.878319
2       3.206107
3       3.033333
4       3.550239
5       3.302326
          ...
1678    1.000000
1679    3.000000
1680    2.000000
1681    3.000000
1682    3.000000
Name: rating, Length: 1682, dtype: float64

In [66]:
ratings.groupby(['movie_id'])['rating'].mean().sort_values(ascending=False)

movie_id
814     5.0
1599    5.0
1201    5.0
1122    5.0
1653    5.0
       ...
1568    1.0
1567    1.0
1566    1.0
1565    1.0
852     1.0
Name: rating, Length: 1682, dtype: float64

In [86]:
ratings.groupby(['movie_id'])['rating'].mean().sort_values(ascending=False).iloc[:5]

movie_id
814     5.0
1599    5.0
1201    5.0
1122    5.0
1653    5.0
Name: rating, dtype: float64

In [6]:
# best-seller 추천
def recom_movie1(n_items):
    movie_sort = movie_mean.sort_values(ascending=False).iloc[:n_items]
    recom_movies = movies.loc[movie_sort.index]
    recommendation = recom_movies['title']
    return recommendation

movie_mean = ratings.groupby(['movie_id'])['rating'].mean()
recom_movie1(5)

movie_id
814                         Great Day in Harlem, A (1994)
1599                        Someone Else's America (1995)
1201           Marlene Dietrich: Shadow and Light (1996)
1122                       They Made Me a Criminal (1939)
1653    Entertaining Angels: The Dorothy Day Story (1996)
Name: title, dtype: object

In [9]:
def recom_movie2(n_items):
    return movies.loc[movie_mean.sort_values(ascending=False).iloc[:n_items].index]['title']

recom_movie2(5)

movie_id
814                         Great Day in Harlem, A (1994)
1599                        Someone Else's America (1995)
1201           Marlene Dietrich: Shadow and Light (1996)
1122                       They Made Me a Criminal (1939)
1653    Entertaining Angels: The Dorothy Day Story (1996)
Name: title, dtype: object

In [10]:
def RMSE(y_true, y_pred): # root mean square error
    return np.sqrt(np.mean((np.array(y_true) - np.array(y_pred))**2))

In [11]:
rmse = []
for user in set(ratings.index):
    y_true = ratings.loc[user]['rating']
    y_pred = movie_mean[ratings.loc[user]['movie_id']]
    accuracy = RMSE(y_true, y_pred)
    rmse.append(accuracy)
print(np.mean(rmse))

0.996007224010567